Repository: johnychnouda/Bechaalany-Debt
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Bechaalany Connect
ar: بيشعلاني كونكت

# navDashboard
source: Dashboard
ar: لوحة التحكم

# navCustomers
source: Customers
ar: العملاء

# navProducts
source: Products
ar: المنتجات

# navActivities
source: Activities
ar: السجل

# navAdmin
source: Admin
ar: الإدارة

# navSettings
source: Settings
ar: الإعدادات

# dashboardWelcomeBack
source: Welcome back
ar: مرحباً بعودتك

source: Financial Analysis
ar: التحليل المالي

source: Total Revenue
ar: إجمالي الإيرادات

source: From product profit margins
ar: من هوامش ربح المنتجات

source: Potential Revenue
ar: الإيرادات المحتملة

source: From unpaid amounts
ar: من المبالغ غير المسددة

source: Total Debts
ar: إجمالي الديون

source: Outstanding amounts
ar: المبالغ المتبقية

source: Total Payments
ar: إجمالي المدفوعات

source: From customer payments
ar: من مدفوعات العملاء

source: Total Customers and Debtors
ar: إجمالي العملاء والمدينين

source: Customers with Debts
ar: عملاء لديهم ديون

source: Total Customers
ar: إجمالي العملاء

# noCustomersAddedYet
source: No customers added yet. Add your first customer to get started!
ar: لم تتم إضافة عملاء بعد. أضف أول عميل للبدء!

# percentCustomersPendingDebts
source: {percent}% of customers have pending debts
ar: {percent}٪ من العملاء لديهم ديون معلقة

source: Top Debtors
ar: أكبر المدينين

source: No outstanding debts
ar: لا توجد ديون معلقة

# settingsTitle
source: Settings
ar: الإعدادات

# sectionAccount
source: Account
ar: الحساب

# sectionAppearance
source: Appearance
ar: المظهر

# sectionBusinessSettings
source: Business Settings
ar: إعدادات العمل

# sectionWhatsAppAutomation
source: WhatsApp Automation
ar: رسائل واتساب التلقائية

# sectionDataManagement
source: Data Management
ar: إدارة البيانات

# sectionAppInfo
source: App Info
ar: معلومات التطبيق

source: Access Status
ar: حالة الوصول

# accessStatusSubtitle
source: View your access status and contact support if needed
ar: عرض حالة وصولك والتواصل مع الدعم عند الحاجة

source: Sign Out
ar: تسجيل الخروج

# signOutSubtitle
source: Sign out of your account
ar: تسجيل الخروج من حسابك

source: Delete Account
ar: حذف الحساب

# deleteAccountSubtitle
source: Permanently delete your account and all data
ar: حذف حسابك وجميع البيانات نهائياً

# deleteAccountDialogMessage
source: This will permanently delete your account and all associated data including: • All customers and debts • All activities and payment records • All backups • All settings and preferences This action cannot be undone.
ar: سيتم حذف حسابك وجميع البيانات المرتبطة به نهائياً، بما في ذلك: • جميع العملاء والديون • جميع الأنشطة وسجلات الدفع • جميع النسخ الاحتياطية • جميع الإعدادات والتفضيلات لا يمكن التراجع عن هذا الإجراء.

source: Final Confirmation
ar: التأكيد النهائي

# finalConfirmationDeleteMessage
source: This is your last chance to cancel. Your account and all data will be permanently deleted. This cannot be undone.
ar: هذه آخر فرصة للإلغاء. سيتم حذف حسابك وجميع البيانات نهائياً. لا يمكن التراجع عن ذلك.

source: Language
ar: اللغة

# languageSubtitle
source: App language (English or Arabic)
ar: لغة التطبيق (العربية أو الإنجليزية)

source: Dark Mode
ar: الوضع الداكن

# darkModeSubtitle
source: Use dark appearance
ar: استخدام المظهر الداكن

source: Business Name
ar: اسم العمل

# businessNameSubtitle
source: Set your business name for receipts and messages
ar: تعيين اسم عملك للإيصالات والرسائل

# currencyAndRates
source: Currency & Exchange Rates
ar: العملة وأسعار الصرف

# currencyAndRatesSubtitle
source: Configure currency settings and rates
ar: ضبط إعدادات العملة والأسعار

source: Enable Automated Messages
ar: تفعيل الرسائل التلقائية

# enableAutomatedMessagesSubtitle
source: Send WhatsApp messages for debt settlements and payment reminders
ar: إرسال رسائل واتساب لتسويات الديون وتذكيرات الدفع

source: Send Payment Reminders
ar: إرسال تذكيرات الدفع

# sendPaymentRemindersSubtitle
source: Manually send WhatsApp reminders to customers with remaining debts
ar: إرسال تذكيرات واتساب يدوياً للعملاء الذين لديهم ديون متبقية

# paymentRemindersTitle
source: Payment Reminders
ar: تذكيرات الدفع

# clearSelection
source: Clear
ar: مسح

source: Select All
ar: تحديد الكل

# paymentRemindersCustomerCountOne
source: 1 customer with outstanding debts
ar: عميل واحد لديه ديون معلقة

# paymentRemindersCustomerCountOther
source: {count} customers with outstanding debts
ar: {count} عملاء لديهم ديون معلقة

# paymentRemindersSelectedOne
source: 1 customer selected
ar: عميل واحد محدد

# paymentRemindersSelectedOther
source: {count} customers selected
ar: {count} عملاء محددين

source: Send Reminders
ar: إرسال التذكيرات

source: All clear!
ar: كل شيء واضح!

# noCustomersOutstandingDebts
source: No customers have outstanding debts
ar: لا يوجد عملاء لديهم ديون معلقة

# sendPaymentReminderDialogTitle
source: Send Payment Reminder
ar: إرسال تذكير بالدفع

# batchReminderSubtitle
source: This message will be sent via WhatsApp to all selected customers
ar: سيتم إرسال هذه الرسالة عبر واتساب لجميع العملاء المحددين

# enterCustomMessage
source: Enter your custom message...
ar: أدخل رسالتك المخصصة...

source: Send to {count}
ar: إرسال إلى {count}

# allRemindersSentSuccess
source: All reminders sent successfully!
ar: تم إرسال جميع التذكيرات بنجاح!

# sentToCountOfTotal
source: Sent to {success} out of {total} customers
ar: تم الإرسال إلى {success} من أصل {total} عملاء

# batchRemindersFailed
source: Failed to send batch payment reminders: {message}
ar: فشل إرسال تذكيرات الدفع الجماعية: {message}

source: Warning
ar: تحذير

# clearDebtsAndActivities
source: Clear Debts & Activities
ar: مسح الديون والسجل

# clearDebtsAndActivitiesSubtitle
source: Remove all debts, activities, and payment records
ar: إزالة جميع الديون والسجلات والمدفوعات

source: Data Recovery
ar: استعادة البيانات

# dataRecoverySubtitle
source: Recover data from backups
ar: استعادة البيانات من النسخ الاحتياطية

source: Manual Backup
ar: نسخ احتياطي يدوي

source: Create Backup
ar: إنشاء نسخة احتياطية

# backupButton
source: Backup
ar: نسخ

source: Automatic Backup
ar: نسخ احتياطي تلقائي

source: Daily Backup at 12 AM
ar: نسخ احتياطي يومي عند ١٢ صباحاً

# nextBackupIn
source: Next backup in: {time}
ar: النسخ الاحتياطي التالي خلال: {time}

# hoursShort
source: h
ar: س

# minutesShort
source: m
ar: د

# secondsShort
source: s
ar: ث

# lastBackup
source: Last backup: {time}
ar: آخر نسخ احتياطي: {time}

source: Never
ar: أبداً

source: Available Backups
ar: النسخ الاحتياطية المتاحة

# noBackupsAvailable
source: No backups available. Create your first backup to get started.
ar: لا توجد نسخ احتياطية. أنشئ أول نسخة احتياطية للبدء.

# signInToViewBackups
source: Please sign in to view and manage your backups.
ar: يرجى تسجيل الدخول لعرض وإدارة النسخ الاحتياطية.

# automaticBackupLabel
source: Automatic backup
ar: نسخ احتياطي تلقائي

# manualBackupLabel
source: Manual backup
ar: نسخ احتياطي يدوي

source: Restore
ar: استعادة

source: Restore Data
ar: استعادة البيانات

# restoreDataConfirm
source: This will replace all current data with the backup. This action cannot be undone. Are you sure?
ar: سيستبدل هذا جميع البيانات الحالية بالنسخة الاحتياطية. لا يمكن التراجع عن هذا الإجراء. هل أنت متأكد؟

source: Delete Backup
ar: حذف النسخة الاحتياطية

# deleteBackupConfirm
source: This will permanently delete the backup file. This action cannot be undone. Are you sure?
ar: سيؤدي هذا إلى حذف ملف النسخة الاحتياطية نهائياً. لا يمكن التراجع عن هذا الإجراء. هل أنت متأكد؟

source: Developer
ar: المطور

source: App Version
ar: إصدار التطبيق

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: OK
ar: موافق

source: Success
ar: تم بنجاح

source: Error
ar: خطأ

# businessNameDialogTitle
source: Business Name
ar: اسم العمل

# businessNameDialogHint
source: Your business name will appear on receipts, payment reminders, and all customer communications.
ar: سيظهر اسم عملك على الإيصالات وتذكيرات الدفع وجميع تواصلات العملاء.

# enterBusinessName
source: Enter your business name
ar: أدخل اسم عملك

# businessNameRequired
source: Business name is required
ar: اسم العمل مطلوب

# businessNameUpdated
source: Business name has been updated successfully.
ar: تم تحديث اسم العمل بنجاح.

# businessNameUpdateFailed
source: Failed to update business name: {message}
ar: فشل تحديث اسم العمل: {message}

# appInfoTitle
source: App Information
ar: معلومات التطبيق

# appInfoName
source: Bechaalany Debt App
ar: تطبيق ديون بيشعلاني

# appInfoDescription
source: A comprehensive debt management application for tracking customer debts, payments, and business revenue.
ar: تطبيق شامل لإدارة الديون وتتبع ديون العملاء والمدفوعات وإيرادات العمل.

# appInfoFeaturesTitle
source: Features:
ar: المميزات:

# appInfoFeaturesList
source: • Customer debt tracking • Payment management • Revenue calculations • Product catalog • WhatsApp automation • Data backup & recovery
ar: • تتبع ديون العملاء • إدارة المدفوعات • حسابات الإيرادات • كتالوج المنتجات • أتمتة واتساب • النسخ الاحتياطي واستعادة البيانات

# clearDebtsDialogTitle
source: Clear Debts & Activities
ar: مسح الديون والسجل

# clearDebtsDialogContent
source: This will permanently delete all debts, activities, and payment records. Products and customers will be preserved. This action cannot be undone. Are you sure you want to proceed?
ar: سيؤدي هذا إلى حذف جميع الديون والسجلات والمدفوعات نهائياً. سيتم الاحتفاظ بالمنتجات والعملاء. لا يمكن التراجع عن هذا الإجراء. هل أنت متأكد من المتابعة؟

# clearDebtsButton
source: Clear Debts
ar: مسح الديون

# clearDebtsSuccess
source: All debts, activities, and payment records have been cleared successfully. Products and customers have been preserved.
ar: تم مسح جميع الديون والسجلات والمدفوعات بنجاح. تم الاحتفاظ بالمنتجات والعملاء.

# signInTitleBechaalany
source: Bechaalany
ar: بيشعلاني

# signInTitleConnect
source: Connect
ar: كونكت

# signInSubtitle
source: Sign in with your Google or Apple account to get started
ar: سجّل الدخول بحساب Google أو Apple للبدء

# signInSubtitleGoogleOnly
source: Sign in with your Google account to get started
ar: سجّل الدخول بحساب Google للبدء

# signingIn
source: Signing you in...
ar: جاري تسجيل الدخول...

source: Continue with Google
ar: المتابعة مع Google

source: Continue with Apple
ar: المتابعة مع Apple

# googleSignInCancelled
source: Google sign-in was cancelled
ar: تم إلغاء تسجيل الدخول عبر Google

# googleSignInFailed
source: Google sign-in failed: {message}
ar: فشل تسجيل الدخول عبر Google: {message}

# appleSignInCancelled
source: Apple sign-in was cancelled
ar: تم إلغاء تسجيل الدخول عبر Apple

# appleSignInCancelledTryAgain
source: Apple sign-in was cancelled. Please try again.
ar: تم إلغاء تسجيل الدخول عبر Apple. يرجى المحاولة مرة أخرى.

# appleSignInNotAvailable
source: Apple Sign-In is not available. Please check your device settings.
ar: تسجيل الدخول عبر Apple غير متاح. تحقق من إعدادات جهازك.

# networkError
source: Network error. Please check your internet connection.
ar: خطأ في الشبكة. تحقق من اتصال الإنترنت.

# appleSignInFailed
source: Apple sign-in failed. Please try again or use Google Sign-In instead.
ar: فشل تسجيل الدخول عبر Apple. يرجى المحاولة مرة أخرى أو استخدام Google.

# requiredSetupTitle
source: Required Setup
ar: الإعداد المطلوب

# requiredSetupSubtitle
source: Complete the following to start using the app
ar: أكمل التالي لبدء استخدام التطبيق

# requiredSetupHeaderTitle
source: Let's get you set up
ar: لنُعد التطبيق معك

# requiredSetupHeaderSubtitle
source: Just two things — takes less than a minute.
ar: خطوتان فقط — تستغرق أقل من دقيقة.

source: Shop Name
ar: اسم المحل

# shopNameLabel
source: What's your shop or business name?
ar: ما اسم محلك أو عملك؟

# shopNameHint
source: Shown on receipts
ar: يظهر على الإيصالات

# shopNamePlaceholder
source: e.g. My Shop
ar: مثال: متجري

source: Exchange Rate
ar: سعر الصرف

# exchangeRateLabel
source: What's 1 USD in LBP right now?
ar: كم يساوي 1 دولار بالليرة الآن؟

# exchangeRateHint
source: Enter the number only
ar: أدخل الرقم فقط

# exchangeRatePlaceholder
source: e.g. 89,000
ar: مثال: 89000

# continueButton
source: Continue
ar: متابعة

source: Get started
ar: ابدأ

# couldNotLoadValues
source: Could not load current values.
ar: تعذر تحميل القيم الحالية.

# addShopNameToContinue
source: Add your shop name to continue.
ar: أضف اسم المحل للمتابعة.

# enterValidExchangeRate
source: Please enter a valid exchange rate (number greater than 0).
ar: أدخل سعر صرف صحيح (رقم أكبر من صفر).

# enterRateToContinue
source: Enter the current rate (e.g. 89,000) to continue.
ar: أدخل سعر الصرف الحالي (مثال: 89000) للمتابعة.

# settingsHint
source: You can change these anytime in Settings.
ar: يمكنك تغيير هذه الإعدادات في أي وقت من الإعدادات.

# saveFailedTryAgain
source: Failed to save. Please try again.
ar: فشل الحفظ. يرجى المحاولة مرة أخرى.

source: Saving...
ar: جاري الحفظ...

# setupSaved
source: Setup saved. You can start using the app.
ar: تم حفظ الإعداد. يمكنك بدء استخدام التطبيق.

# setupSaveFailed
source: Failed to save: {message}
ar: فشل الحفظ: {message}

source: Search by name or ID
ar: البحث بالاسم أو المعرّف

# customersTitle
source: Customers
ar: العملاء

# customersCount
source: {count} customers
ar: {count} عملاء

# customerCountOne
source: 1 customer
ar: عميل واحد

source: No customers yet
ar: لا يوجد عملاء بعد

source: No customers found
ar: لم يتم العثور على عملاء

# startByAddingFirstCustomer
source: Start by adding your first customer
ar: ابدأ بإضافة أول عميل

# tryAdjustingSearchCriteria
source: Try adjusting your search criteria
ar: جرّب تعديل معايير البحث

source: Delete Customer
ar: حذف العميل

# deleteCustomerConfirmWithDebts
source: This customer has {count} debt(s). Deleting the customer will also delete all associated debts. Are you sure?
ar: هذا العميل لديه {count} دين/ديون. حذف العميل سيحذف جميع الديون المرتبطة. هل أنت متأكد؟

# deleteCustomerConfirm
source: Are you sure you want to delete this customer?
ar: هل أنت متأكد من حذف هذا العميل؟

# deleteCustomerConfirmWithName
source: Are you sure you want to delete {name}? This action cannot be undone.
ar: هل أنت متأكد من حذف {name}؟ لا يمكن التراجع عن هذا الإجراء.

source: View Details
ar: عرض التفاصيل

source: Delete
ar: حذف

source: Search products...
ar: البحث في المنتجات...

# filterAll
source: All
ar: الكل

source: Refresh
ar: تحديث

source: No categories found
ar: لم يتم العثور على تصنيفات

source: Add categories to get started
ar: أضف تصنيفات للبدء

source: No products found
ar: لم يتم العثور على منتجات

# tryAdjustingSearchTerms
source: Try adjusting your search terms
ar: جرّب تعديل كلمات البحث

source: Add products to get started
ar: أضف منتجات للبدء

source: Add products to {category} to get started
ar: أضف منتجات إلى {category} للبدء

source: No products in {category}
ar: لا توجد منتجات في {category}

source: Category not found
ar: التصنيف غير موجود

source: Activity History
ar: سجل النشاط

source: Generate Monthly Report
ar: إنشاء التقرير الشهري

source: Daily
ar: يومي

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Yearly
ar: سنوي

source: Today's Activity
ar: نشاط اليوم

# weeklyActivityRange
source: Weekly Activity - {start} - {end}
ar: النشاط الأسبوعي - {start} - {end}

# monthlyActivityMonth
source: Monthly Activity - {monthYear}
ar: النشاط الشهري - {monthYear}

source: Yearly Activity - {year}
ar: النشاط السنوي - {year}

source: Total Paid
ar: إجمالي المدفوع

# noActivityToday
source: No activity today Add debts or make payments to see activity here
ar: لا يوجد نشاط اليوم أضف ديوناً أو قم بالدفع لرؤية النشاط هنا

# noActivityThisWeek
source: No activity this week Add debts or make payments to see activity here
ar: لا يوجد نشاط هذا الأسبوع أضف ديوناً أو قم بالدفع لرؤية النشاط هنا

# noActivityThisMonth
source: No activity this month Add debts or make payments to see activity here
ar: لا يوجد نشاط هذا الشهر أضف ديوناً أو قم بالدفع لرؤية النشاط هنا

# noActivityThisYear
source: No activity this year Add debts or make payments to see activity here
ar: لا يوجد نشاط هذه السنة أضف ديوناً أو قم بالدفع لرؤية النشاط هنا

source: No activities found for "{query}"
ar: لم يتم العثور على أنشطة لـ "{query}"

source: Today at {time}
ar: اليوم عند {time}

source: Yesterday at {time}
ar: أمس عند {time}

source: {date} at {time}
ar: {date} عند {time}

source: Admin Dashboard
ar: لوحة تحكم المشرف

source: Dashboard Overview
ar: نظرة عامة على اللوحة

# monitorUserStatistics
source: Monitor your user statistics
ar: مراقبة إحصائيات المستخدمين

source: Overview
ar: نظرة عامة

source: Total Users
ar: إجمالي المستخدمين

source: All registered users
ar: جميع المستخدمين المسجلين

source: Active
ar: نشط

source: Active access
ar: وصول نشط

source: Trial
ar: تجريبي

source: On trial period
ar: في الفترة التجريبية

source: Expired
ar: منتهي

source: Expired access
ar: وصول منتهي

source: Quick Actions
ar: إجراءات سريعة

source: Manage Users
ar: إدارة المستخدمين

source: View & manage all users
ar: عرض وإدارة جميع المستخدمين

source: Loading dashboard...
ar: جاري تحميل اللوحة...

source: Unable to Load Dashboard
ar: تعذر تحميل اللوحة

source: Retry
ar: إعادة المحاولة

# noUsersInSystem
source: No users in the system yet
ar: لا يوجد مستخدمون في النظام بعد

# noUsersYetSubtitle
source: User statistics will appear here once users start registering.
ar: ستظهر إحصائيات المستخدمين هنا عند بدء التسجيل.

source: User Management
ar: إدارة المستخدمين

source: Search by email or name...
ar: البحث بالبريد أو الاسم...

# monthlyFilter
source: Monthly
ar: شهري

# yearlyFilter
source: Yearly
ar: سنوي

# userSummaryCounts
source: All: {all} • Trial: {trial} • Monthly: {monthly} • Yearly: {yearly} • Expired: {expired}
ar: الكل: {all} • تجريبي: {trial} • شهري: {monthly} • سنوي: {yearly} • منتهي: {expired}

source: No users found
ar: لم يتم العثور على مستخدمين

# noUsersMatchSearch
source: No users match your search
ar: لا يوجد مستخدمون يطابقون بحثك

source: No trial users found
ar: لم يتم العثور على مستخدمين تجريبيين

source: No monthly users found
ar: لم يتم العثور على مستخدمين شهريين

source: No yearly users found
ar: لم يتم العثور على مستخدمين سنويين

source: No expired users found
ar: لم يتم العثور على مستخدمين منتهين

source: Access Denied
ar: تم رفض الوصول

# noAdminPermissions
source: You do not have admin permissions to view this page.
ar: ليس لديك صلاحيات المشرف لعرض هذه الصفحة.

source: Trial Expired
ar: انتهت الفترة التجريبية

source: Cancelled
ar: ملغى

# activeStatus
source: Active
ar: نشط

source: Permission Denied
ar: تم رفض الإذن

# permissionDeniedMessage
source: You do not have permission to access user data. Please ensure your account is marked as admin in Firestore.
ar: ليس لديك إذن للوصول إلى بيانات المستخدمين. تأكد من أن حسابك معرّف كمشرف في Firestore.

source: Add Customer
ar: إضافة عميل

source: Edit Customer
ar: تعديل العميل

source: Update Customer
ar: تحديث العميل

source: Customer Information
ar: معلومات العميل

source: Financial Summary
ar: الملخص المالي

source: Customer ID
ar: معرّف العميل

# customerIdRequired
source: Customer ID *
ar: معرّف العميل *

source: Enter customer ID
ar: أدخل معرّف العميل

source: Please enter customer ID
ar: يرجى إدخال معرّف العميل

source: Customer ID already exists
ar: معرّف العميل موجود مسبقاً

# customerIdInvalidChars
source: Customer ID can only contain letters, numbers, underscore, and hyphen
ar: معرّف العميل يمكن أن يحتوي على حروف وأرقام وشرطة سفلية وشرطة فقط

source: This Customer ID already exists
ar: معرّف العميل هذا موجود مسبقاً

source: Full Name *
ar: الاسم الكامل *

source: Enter customer name
ar: أدخل اسم العميل

source: Please enter customer name
ar: يرجى إدخال اسم العميل

source: Phone Number *
ar: رقم الهاتف *

source: Enter phone number
ar: أدخل رقم الهاتف

source: Please enter phone number
ar: يرجى إدخال رقم الهاتف

# validPhoneNumber
source: Please enter a valid phone number (minimum 8 digits)
ar: يرجى إدخال رقم هاتف صحيح (8 أرقام على الأقل)

source: This phone number already exists
ar: رقم الهاتف هذا موجود مسبقاً

source: Duplicate Phone Number
ar: رقم هاتف مكرر

# duplicatePhoneMessage
source: The phone number "{phone}" is already used by customer "{name}" (ID: {id}). Do you want to continue with this phone number?
ar: رقم الهاتف "{phone}" مستخدم بالفعل من قبل العميل "{name}" (المعرّف: {id}). هل تريد المتابعة بهذا الرقم؟

source: Email Address
ar: البريد الإلكتروني

source: Enter email (optional)
ar: أدخل البريد (اختياري)

# pleaseEnterValidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# validEmailDomain
source: Please enter a valid email domain
ar: يرجى إدخال نطاق بريد إلكتروني صحيح

# thisEmailAlreadyUsed
source: This email is already used by another customer
ar: هذا البريد مستخدم من قبل عميل آخر

source: Address
ar: العنوان

source: Enter address (optional)
ar: أدخل العنوان (اختياري)

source: Add
ar: إضافة

source: Add Category
ar: إضافة تصنيف

source: Add Product
ar: إضافة منتج

source: Delete Category
ar: حذف التصنيف

source: Delete Product
ar: حذف المنتج

source: Category Name
ar: اسم التصنيف

# categoryNameHint
source: e.g., Electronics
ar: مثال: إلكترونيات

source: Select Category
ar: اختر التصنيف

# chooseCategoryToAddSubcategory
source: Choose a category to add a subcategory to:
ar: اختر تصنيفاً لإضافة صنف فرعي إليه:

# subcategoriesCount
source: {count} subcategories
ar: {count} أصناف فرعية

# addSubcategoryTo
source: Add Subcategory to {name}
ar: إضافة صنف فرعي إلى {name}

source: Subcategory Name
ar: اسم الصنف الفرعي

# subcategoryNameHint
source: e.g., iPhone
ar: مثال: آيفون

# currencyLabel
source: Currency
ar: العملة

source: Cost Price
ar: سعر التكلفة

source: Selling Price
ar: سعر البيع

# productCost
source: Cost
ar: التكلفة

# productPrice
source: Price
ar: السعر

# productRevenue
source: Revenue
ar: الإيراد

# productLoss
source: Loss
ar: الخسارة

source: Enter cost price
ar: أدخل سعر التكلفة

source: Enter selling price
ar: أدخل سعر البيع

source: Exchange Rate Required
ar: سعر الصرف مطلوب

# setExchangeRateInSettings
source: Please set an exchange rate in Currency Settings before adding products with LBP.
ar: يرجى تعيين سعر الصرف في إعدادات العملة قبل إضافة منتجات بالليرة.

source: Go to Settings
ar: الذهاب إلى الإعدادات

source: Confirm
ar: تأكيد

source: Edit Category Name
ar: تعديل اسم التصنيف

source: Category Name Exists
ar: اسم التصنيف موجود

source: Add Debt from Product
ar: إضافة دين من منتج

# customerLabel
source: Customer
ar: العميل

# categoryLabel
source: Category
ar: التصنيف

# productLabel
source: Product
ar: المنتج

source: Select Product
ar: اختر المنتج

source: Product Details
ar: تفاصيل المنتج

# selectProductAboveToViewDetails
source: Select a product above to view details
ar: اختر منتجاً أعلاه لعرض التفاصيل

source: Add Debt
ar: إضافة دين

source: Unit Price
ar: سعر الوحدة

source: Quantity
ar: الكمية

source: Total Amount
ar: المبلغ الإجمالي

source: Not selected
ar: لم يتم الاختيار

# addProductsToCategoryInProductsTab
source: Add products to this category in the Products tab.
ar: أضف منتجات لهذا التصنيف من تبويب المنتجات.

source: Product Purchases
ar: مشتريات المنتجات

# productsCount
source: {count} products
ar: {count} منتجات

source: Make Payment
ar: إجراء الدفع

source: Total Pending
ar: المبلغ المعلق

source: Created on {date} at {time}
ar: تم الإنشاء في {date} عند {time}

# timeAm
source: AM
ar: ص

# timePm
source: PM
ar: م

source: Customer Receipt
ar: إيصال العميل

source: Generated on
ar: تم الإنشاء في

source: Account Summary
ar: ملخص الحساب

source: Total Original
ar: الإجمالي الأصلي

source: Remaining
ar: المتبقي

source: Transaction History
ar: سجل المعاملات

source: Generated by
ar: تم الإنشاء بواسطة

source: Receipt for
ar: إيصال لـ

# pageOf
source: Page {current} of {total}
ar: صفحة {current} من {total}

# idLabel
source: ID
ar: المعرّف

source: Partial Payment
ar: دفعة جزئية

source: Outstanding Debt
ar: دين معلق

source: New Debt
ar: دين جديد

source: Fully Paid
ar: مدفوع بالكامل

source: Debt Paid
ar: تم السداد

source: Activity
ar: نشاط
