Repository: johnychnouda/Bechaalany-Debt
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Delete Debt
ar: حذف الدين

# deleteDebtConfirm
source: Are you sure you want to delete this debt?
ar: هل أنت متأكد أنك تريد حذف هذا الدين؟

source: Debt Details:
ar: تفاصيل الدين:

# amountLabel
source: Amount:
ar: المبلغ:

# deleteDebtCannotUndo
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Monthly Activity Report
ar: تقرير النشاط الشهري

# reportSummary
source: Summary
ar: الملخص

# transactionsLabel
source: Transactions
ar: المعاملات

source: Activity Details
ar: تفاصيل النشاط

source: User Details
ar: تفاصيل المستخدم

source: Loading user details…
ar: جاري تحميل تفاصيل المستخدم…

source: Current Status
ar: الحالة الحالية

source: Actions
ar: الإجراءات

source: Updating…
ar: جاري التحديث…

source: Grant Access
ar: منح الوصول

# grantAccessDescription
source: Grant continued access to this user. Choose duration.
ar: منح وصول مستمر لهذا المستخدم. اختر المدة.

# oneMonth
source: 1 Month
ar: شهر واحد

# oneYear
source: 1 Year
ar: سنة واحدة

source: Revoke Access
ar: سحب الوصول

# revokeAccessDescription
source: Temporarily suspend this account. The user can contact you if there is an issue.
ar: تعليق هذا الحساب مؤقتاً. يمكن للمستخدم التواصل معك في حال وجود مشكلة.

# revokeAccessConfirm
source: Are you sure you want to revoke this user's access?
ar: هل أنت متأكد أنك تريد سحب وصول هذا المستخدم؟

source: Revoke
ar: سحب

# accessGrantedSuccess
source: Access granted successfully ({duration})!
ar: تم منح الوصول بنجاح ({duration})!

# failedToGrantAccess
source: Failed to grant access: {error}
ar: فشل منح الوصول: {error}

# accessRevokedSuccess
source: Access revoked successfully!
ar: تم سحب الوصول بنجاح!

# failedToRevokeAccess
source: Failed to revoke access: {error}
ar: فشل سحب الوصول: {error}

source: No access data
ar: لا توجد بيانات وصول

source: Status
ar: الحالة

source: Trial Started
ar: بداية الفترة التجريبية

source: Trial Ends
ar: نهاية الفترة التجريبية

source: Access Started
ar: بداية الوصول

source: Access Ends
ar: نهاية الوصول

source: Access Period
ar: فترة الوصول

source: Updated {date}
ar: تم التحديث {date}

# dateExpired
source: (Expired)
ar: (منتهي)

# dateDaysLeftOne
source: (1 day left)
ar: (يوم واحد متبقي)

# dateDaysLeftOther
source: ({count} days left)
ar: ({count} أيام متبقية)

# oneMonthLabel
source: 1 month
ar: شهر واحد

# oneYearLabel
source: 1 year
ar: سنة واحدة

source: Request Access
ar: طلب الوصول

source: Free Trial
ar: تجربة مجانية

source: Access Expired
ar: انتهى الوصول

source: Access Cancelled
ar: تم إلغاء الوصول

source: Trial details
ar: تفاصيل التجربة

source: Trial period
ar: فترة التجربة

# daysRemaining
source: {count} days remaining
ar: {count} أيام متبقية

source: Access details
ar: تفاصيل الوصول

# yourAccessExpired
source: Your access has expired
ar: انتهى وصولك

# yourAccessCancelled
source: Your access has been cancelled
ar: تم إلغاء وصولك

# expiredContactMessage
source: If you believe this is a mistake or need help with your account, contact the administrator for support.
ar: إذا كنت تعتقد أن هذا خطأ أو تحتاج مساعدة في حسابك، تواصل مع المسؤول للحصول على الدعم.

source: Contact Administrator
ar: التواصل مع المسؤول

source: Access status and renewals
ar: حالة الوصول والتجديد

# requestAccessInfoMessage
source: If your trial or access period ends and you still cannot use the app, you can contact the administrator for help fixing your account.
ar: إذا انتهت فترة تجربتك أو وصولك ولا يزال لا يمكنك استخدام التطبيق، يمكنك التواصل مع المسؤول للمساعدة في إصلاح حسابك.

# welcomeToBechaalany
source: Welcome to Bechaalany Debt App
ar: مرحباً بك في تطبيق بيشعلاني للديون

# welcomeNoDataMessage
source: The app is completely free and available to all signed-in users. If you ever have trouble accessing your data, you can contact the administrator for technical support.
ar: التطبيق مجاني بالكامل ومتاح لجميع المستخدمين المسجلين. إذا واجهت مشكلة في الوصول إلى بياناتك، يمكنك التواصل مع المسؤول للحصول على الدعم الفني.

source: WhatsApp
ar: واتساب

source: Phone
ar: هاتف
